1.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soap:Envelope
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <PosRequest
            xmlns="http://Hps.Exchange.PosGateway">
            <Ver1.0>
                <Header>
                    <SecretAPIKey>skapi_cert_MVsvBgBYKwAAbtHMSzioi5nKn5vfw3jOqC1TPzbO5g</SecretAPIKey>
                    <VersionNbr>0000</VersionNbr>
                    <DeveloperID>000000</DeveloperID>
                    <PosReqDT>2025-12-11T16:01:33.473+08:00</PosReqDT>
                    <SDKNameVersion>java;version=2.7.10</SDKNameVersion>
                </Header>
                <Transaction>
                    <CreditSale>
                        <Block1>
                            <AllowDup>Y</AllowDup>
                            <AllowPartialAuth>N</AllowPartialAuth>
                            <AmountIndicator>F</AmountIndicator>
                            <Amt>4.00</Amt>
                            <CardHolderData>
                                <CardHolderAddr>4 CORPORATE SQ</CardHolderAddr>
                                <CardHolderZip>303292010</CardHolderZip>
                            </CardHolderData>
                            <CardOnFileData>
                                <CardOnFile>C</CardOnFile>
                            </CardOnFileData>
                            <CardData>
                                <ManualEntry>
                                    <CardNbr>601100XXXXXX1250</CardNbr>
                                    <ExpMonth>12</ExpMonth>
                                    <ExpYear>2026</ExpYear>
                                    <CVV2>123</CVV2>
                                    <ReaderPresent>N</ReaderPresent>
                                    <CardPresent>N</CardPresent>
                                </ManualEntry>
                                <TokenRequest>Y</TokenRequest>
                            </CardData>
                            <Ecommerce>MOTO</Ecommerce>
                            <DirectMktData>
                                <DirectMktInvoiceNbr/>
                                <DirectMktShipDay>12</DirectMktShipDay>
                                <DirectMktShipMonth>12</DirectMktShipMonth>
                            </DirectMktData>
                        </Block1>
                    </CreditSale>
                </Transaction>
            </Ver1.0>
        </PosRequest>
    </soap:Body>
</soap:Envelope>
